{
  "_num_labels": 5,
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-BRAND",
    "2": "I-BRAND",
    "3": "B-MODEL",
    "4": "I-MODEL",
    "5": "B-RAM",
    "6": "I-RAM",
    "7": "B-STORAGE",
    "8": "I-STORAGE",
    "9": "B-SCREEN_SIZE",
    "10": "I-SCREEN_SIZE",
    "11": "B-BUDGET",
    "12": "I-BUDGET",
    "13": "B-USAGE",
    "14": "I-USAGE",
    "15": "B-TOUCHSCREEN",
    "16": "I-TOUCHSCREEN"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-BRAND": 1,
    "B-BUDGET": 11,
    "B-MODEL": 3,
    "B-RAM": 5,
    "B-SCREEN_SIZE": 9,
    "B-STORAGE": 7,
    "B-TOUCHSCREEN": 15,
    "B-USAGE": 13,
    "I-BRAND": 2,
    "I-BUDGET": 12,
    "I-MODEL": 4,
    "I-RAM": 6,
    "I-SCREEN_SIZE": 10,
    "I-STORAGE": 8,
    "I-TOUCHSCREEN": 16,
    "I-USAGE": 14,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 50000
}
